In [1]:
import pandas as pd
import numpy as np

In [2]:
product_df = pd.read_csv("product_data.csv")
product_df.head(3)

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [3]:
index = 2
product_df.loc[index]

ProductID                  3
ProductName         Split AC
Cost                   32050
ShippingLocation        Pune
SellerName           XY Corp
Name: 2, dtype: object

In [4]:
product_df

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

In [5]:
product_df.iloc[:, 1:4]

  ProductName   Cost ShippingLocation
0       LEDTV  32990            Delhi
1     Printer   5990            Delhi
2    Split AC  32050             Pune
3   Microwave  12670           Mumbai

In [6]:
# -------------------------------------------------****------------------------------------------------

In [7]:
# -----------------------------------------Data Cleaing ----------------------------------------------------------

In [10]:
product_df.groupby('SellerName')

In [13]:
product_df.groupby("ProductName")["SellerName"].count()

ProductName
LEDTV        1
Microwave    1
Printer      1
Split AC     1
Name: SellerName, dtype: int64

In [19]:
product_df.corr(numeric_only=True)

           ProductID      Cost
ProductID   1.000000 -0.329618
Cost       -0.329618  1.000000

In [25]:
#Sorting values
product_df.sort_values(by='Cost', ascending = False)

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp
1          2     Printer   5990            Delhi    ABC Pvt

In [23]:
product_df.sort_values(by=['Cost', 'SellerName'], ascending = False)

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp
1          2     Printer   5990            Delhi    ABC Pvt

In [26]:
product_df.dtypes

ProductID            int64
ProductName         object
Cost                 int64
ShippingLocation    object
SellerName          object
dtype: object